FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/constant/momentumTransport
FoamFile { format ascii; class dictionary; location "constant"; object momentumTransport; }
simulationType RAS;
RAS
{
    model kOmegaSST;
    turbulence on;
}
