FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/p
FoamFile { format ascii; class volScalarField; location "0"; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform {{OUTLET_PRESSURE}};
boundaryField { {{P_BOUNDARIES}} }
