FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/T
FoamFile { format ascii; class volScalarField; location "0"; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform {{INLET_TEMPERATURE}};
boundaryField { {{T_BOUNDARIES}} }
