FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/alphat
FoamFile { format ascii; class volScalarField; location "0"; object alphat; }
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField { {{ALPHAT_BOUNDARIES}} }
