FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/k
FoamFile { format ascii; class volScalarField; location "0"; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.1;
boundaryField { {{K_BOUNDARIES}} }
