FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/nut
FoamFile { format ascii; class volScalarField; location "0"; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField { {{NUT_BOUNDARIES}} }
