FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/0/omega
FoamFile { format ascii; class volScalarField; location "0"; object omega; }
dimensions [0 0 -1 0 0 0 0];
internalField uniform 100;
boundaryField { {{OMEGA_BOUNDARIES}} }
