FishGfx.CFD/Templates/OpenFoam14/SteadyCompressible/system/fvSchemes
FoamFile { format ascii; class dictionary; location "system"; object fvSchemes; }
ddtSchemes { default steadyState; }
gradSchemes
{
    default Gauss linear;
    limited cellLimited Gauss linear 1;
    grad(U) $limited;
    grad(k) $limited;
    grad(omega) $limited;
}
divSchemes
{
    default none;
    div(phi,U) bounded Gauss linearUpwind limited;
    turbulence bounded Gauss limitedLinear 1;
    div(phi,k) $turbulence;
    div(phi,omega) $turbulence;
    div(phi,h) $turbulence;
    div(phi,K) $turbulence;
    div(phi,Ekp) $turbulence;
    div(phid,p) Gauss upwind;
    div(phi,(p|rho)) bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
fluxRequired { default no; p; }
wallDist { method meshWave; }
